Classes | Typedefs | Functions
IFC
This section collects functions that are used for different IFC related operations. More...
 Classes
struct  | API_IFCRelationshipData
Contains IFC Entity relations which are specific for the IFC. The IFC Entities are represented by their GlobalId. More...
struct  | API_IFCDifferenceGeneratorState
State used in IFCDifference Generator. More...
struct  | API_IFCEntityDescriptor
Contains IFC Global ID and Archicad ID of an IFC Entity. More...
struct  | API_IFCDifference
Contains an IFC Difference. More...
 Typedefs
typedef GSErrCode __ACENV_CALL  | APIIFCRelationshipDataProc(GS::HashTable< API_Guid, API_IFCRelationshipData > *ifcRelationshipDataTable, const void *par1)
User supplied callback procedure for helping BCF Import.
 Functions
GSErrCode __ACENV_CALL  | ACAPI_Element_GetIFCIdentifier (const API_Guid &elementID, API_Guid &archicadIFCID, API_Guid &externalIFCID)
Get IFC Identifier of an element.
GSErrCode __ACENV_CALL  | ACAPI_Element_GetElemListByIFCIdentifier (const API_Guid *archicadIFCID, const API_Guid *externalIFCID, GS::Array< API_Guid > &elements)
Get elements having a certain IFC identifier.
GSErrCode __ACENV_CALL  | ACAPI_Element_GetIFCType (const API_Guid &elementID, GS::UniString *ifcType, GS::UniString *typeObjectIFCType)
Get IFC type and IfcTypeObject IFC type of an element.
GSErrCode __ACENV_CALL  | ACAPI_Element_GetIFCProperties (const API_Guid &guid_Element, bool storedOnly, GS::Array< API_IFCProperty > *properties)
Get IFC properties of an element.
GSErrCode __ACENV_CALL  | ACAPI_Element_SetIFCProperty (const API_Guid &guid_Element, const API_IFCProperty &property)
Set IFC property of an element.
GSErrCode __ACENV_CALL  | ACAPI_Element_RemoveIFCProperty (const API_Guid &guid_Element, const API_IFCProperty &property)
Remove IFC property of an element.
GSErrCode __ACENV_CALL  | ACAPI_Element_GetIFCAttributes (const API_Guid &guid_Element, bool storedOnly, GS::Array< API_IFCAttribute > *attributes)
Get IFC attributes of an element.
GSErrCode __ACENV_CALL  | ACAPI_Element_SetIFCAttribute (const API_Guid &guid_Element, const API_IFCAttribute &attribute)
Set IFC attribute of an element.
GSErrCode __ACENV_CALL  | ACAPI_Element_GetIFCClassificationReferences (const API_Guid &guid_Element, bool storedOnly, GS::Array< API_IFCClassificationReference > *classificationReferences)
Get IFC classificationreferences of an element.
GSErrCode __ACENV_CALL  | ACAPI_Element_SetIFCClassificationReference (const API_Guid &guid_Element, const API_IFCClassificationReference &classificationReference)
Set IFC classificationreference of an element.
GSErrCode __ACENV_CALL  | ACAPI_Element_RemoveIFCClassificationReference (const API_Guid &guid_Element, const API_IFCClassificationReference &classificationReference)
Remove IFC classificationreference of an element.
GSErrCode __ACENV_CALL  | ACAPI_Element_GetIFCPropertyValuePrimitiveType (const GS::UniString &valueType, API_IFCPropertyValuePrimitiveType *primitiveType)
Get the primitive type of an IFC type.
GSErrCode __ACENV_CALL  | ACAPI_IFC_IFCGuidToAPIGuid (const GS::UniString &ifcGuid, API_Guid &apiGuid)
It converts an API_Guid to an IfcGloballyUniqueId string.
GSErrCode __ACENV_CALL  | ACAPI_IFC_APIGuidToIFCGuid (const API_Guid &apiGuid, GS::UniString &ifcGuid)
It converts an API_Guid to an IfcGloballyUniqueId string.
GSErrCode __ACENV_CALL  | ACAPI_IFC_GetIFCRelationshipData (const API_IFCTranslatorIdentifier &ifcTranslatorIdentifier, API_IFCRelationshipData &ifcRelationshipData)
It generates an IFC Relationship Data based on the input IFC Translator parameter.
GSErrCode __ACENV_CALL  | ACAPI_IFC_GetIFCExportTranslatorsList (GS::Array< API_IFCTranslatorIdentifier > &ifcExportTranslators)
Returns the valid IFC Export Translators.
GSErrCode __ACENV_CALL  | ACAPI_IFC_GetIFCDifferenceState (const API_Guid &viewGuid, const API_IFCTranslatorIdentifier &ifcTranslatorIdentifier, API_IFCDifferenceGeneratorState &ifcDifferenceState)
Generates an IFC Difference based on the input parameters.
GSErrCode __ACENV_CALL  | ACAPI_IFC_GetIFCDifference (const API_IFCDifferenceGeneratorState &previousIFCDifferenceGeneratorState, const API_IFCDifferenceGeneratorState &currentIFCDifferenceGeneratorState, API_IFCDifference &ifcDifference)
Generates an IFC Difference based on the input parameters.
GSErrCode __ACENV_CALL  | ACAPI_IFC_ComplementIFCDifferenceAndMergeIFCRelationshipData (const API_IFCRelationshipData &olderIfcRelationshipData, const API_IFCRelationshipData &newerIfcRelationshipData, API_IFCDifference &ifcDifference, API_IFCRelationshipData &mergedIfcRelationshipData)
Augments the ifcDifference with previously deleted items and merges olderIfcRelationshipData with newerIfcRelationshipData.
GSErrCode __ACENV_CALL  | ACAPI_IFC_InvokeIFCDifferenceExportSettingsDlg (API_Guid &viewGuid, API_IFCTranslatorIdentifier &ifcTranslatorIdentifier)
It opens a dialog where a View and an IFC Export Translator can be selected.
Detailed Description
This section collects functions that are used for different IFC related operations.
Typedef Documentation
◆ APIIFCRelationshipDataProc
 typedef GSErrCode __ACENV_CALL APIIFCRelationshipDataProc(GS::HashTable< API_Guid, API_IFCRelationshipData > *ifcRelationshipDataTable, const void *par1)
User supplied callback procedure for helping BCF Import.
Since
Archicad 26
Parameters
ifcRelationshipDataTable | [out] Gives back a Hashtable where the keys are the IFCProject's GlobalIds and the values are their API_IFCRelationshipData.
par1 | [in] Optional parameter.
Returns
NoError - The function has completed with success.
APIERR_GENERAL - Any user-defined error can be returned.
Remarks
API_IFCRelationshipData may be needed by BCF topics when they refer to such components which are represented by their parent elements in Archicad. A typical example is when an Archicad Wall is exported in IFC as an IFCWall instance having several IFCBuildingElementPart components and the imported BCF topic refers to a certain IFCBuildingElementPart. In this case the BCF importer should convert the IFCBuildingElementPart reference to its parent (IFCWall) and connect its corresponding Archicad Wall element to the created MarkUp Entry. In code it looks like the following: API_IFCRelationshipData ifcRelationshipData; ifcRelationshipData.containmentTable.Add (ifcBuildingElementPartGuid1, ifcWallGuid); ifcRelationshipData.containmentTable.Add (ifcBuildingElementPartGuid2, ifcWallGuid); ifcRelationshipData.containmentTable.Add (ifcBuildingElementPartGuid3, ifcWallGuid); ifcRelationshipDataTable->Add (ifcProjectGuid, ifcRelationshipData); If the origin of the model is the current Archicad project, then we can get the API_IFCRelationshipData which can be generated with ACAPI_IFC_GetIFCRelationshipData. The ifcRelationshipDataTable can have several API_IFCRelationshipData of several IFCProjects. This is because the components of a BCF topic can refer several components which may be located under different IFCProjects. For use see ACAPI_Markup_ImportFromBCF.
Function Documentation
◆ ACAPI_Element_GetElemListByIFCIdentifier()
 GSErrCode __ACENV_CALL ACAPI_Element_GetElemListByIFCIdentifier  |  ( |  const API_Guid *  |  archicadIFCID,
|  const API_Guid *  |  externalIFCID,
|  GS::Array< API_Guid > &  |  elements
)
Get elements having a certain IFC identifier.
Since
Archicad 26
Parameters
archicadIFCID | [in] Archicad IFC ID - it can be nullptr
externalIFCID | [in] External IFC ID - it can be nullptr
elements | [out] GUID of the elements
Returns
NoError - The function has completed with success.
APIERR_BADPARS - Both archicadIFCID and externalIFCID are nullptr or elements parameter is nullptr.
APIERR_MODULNOTINSTALLED - IFC add-on is not present.
Remarks
This function searches for elements having the indicated IFC Guid.
only archicadIFCID contains value - it searches for an element having the indicated Archicad IFC ID. The elements can have maximum 1 element. only externalIFCID contains value - it searches for elements having the indicated External IFC ID. The elements can have more then one element. both archicadIFCID and externalIFCID contains value - it searches for an element having the indicated Archicad IFC ID and External IFC ID. The elements can have maximum 1 element. both input parameters are nullptr - it returns APIERR_BADPARS.
only externalIFCID contains value - it searches for elements having the indicated External IFC ID. The elements can have more then one element. both archicadIFCID and externalIFCID contains value - it searches for an element having the indicated Archicad IFC ID and External IFC ID. The elements can have maximum 1 element. both input parameters are nullptr - it returns APIERR_BADPARS.
both archicadIFCID and externalIFCID contains value - it searches for an element having the indicated Archicad IFC ID and External IFC ID. The elements can have maximum 1 element. both input parameters are nullptr - it returns APIERR_BADPARS.
both input parameters are nullptr - it returns APIERR_BADPARS. Conversion from IFC Guid string (IfcGloballyUniqueId) to API_Guid can be done with ACAPI_IFC_IFCGuidToAPIGuid.
◆ ACAPI_Element_GetIFCAttributes()
 GSErrCode __ACENV_CALL ACAPI_Element_GetIFCAttributes  |  ( |  const API_Guid &  |  guid_Element,
|  bool  |  storedOnly,
|  GS::Array< API_IFCAttribute > *  |  attributes
)
Get IFC attributes of an element.
Parameters
guid_Element | [in] GUID of the element
storedOnly | [in] Get only the core data without the derived content, must be false is most cases
attributes | [out] IFC attributes of the element
Returns
NoError - The function has completed with success.
APIERR_BADPARS - Invalid value passed in the guid_Element parameter or attributes is nullptr.
APIERR_MODULNOTINSTALLED - IFC add-on is not present.
Remarks
This function returns the IFC attributes of an element.
◆ ACAPI_Element_GetIFCClassificationReferences()
 GSErrCode __ACENV_CALL ACAPI_Element_GetIFCClassificationReferences  |  ( |  const API_Guid &  |  guid_Element,
|  bool  |  storedOnly,
|  GS::Array< API_IFCClassificationReference > *  |  classificationReferences
)
Get IFC classificationreferences of an element.
Parameters
guid_Element | [in] GUID of the element
storedOnly | [in] Get only the core data without the derived content, must be false is most cases
classificationReferences | [out] IFC classificationreferences of the element
Returns
NoError - The function has completed with success.
APIERR_BADPARS - Invalid value passed in the guid_Element parameter or classificationReferences is nullptr.
APIERR_MODULNOTINSTALLED - IFC add-on is not present.
Remarks
This function returns the IFC classificationreferences of an element.
◆ ACAPI_Element_GetIFCIdentifier()
 GSErrCode __ACENV_CALL ACAPI_Element_GetIFCIdentifier  |  ( |  const API_Guid &  |  elementID,
|  API_Guid &  |  archicadIFCID,
|  API_Guid &  |  externalIFCID
)
Get IFC Identifier of an element.
Since
Archicad 26
Parameters
elementID | [in] GUID of the element
archicadIFCID | [out] Archicad IFC ID of the element
externalIFCID | [out] External IFC ID of the element
Returns
NoError - The function has completed with success.
APIERR_BADID - Invalid value passed in the elementID parameter.
APIERR_MODULNOTINSTALLED - IFC add-on is not present.
Remarks
This function returns the IFC Identifier of an element. There are two type of identifiers:
Archicad IFC ID - during an IFC export this value will be written to GlobalId attribute and can be seen in IFC Manager.
External IFC ID - if the element is originally from IFC then it contains the GlobalId. If it isn't then it is APINULLGuid. It can be seen in IFC Manager also. Conversion from API_Guid to IFC Guid string (IfcGloballyUniqueId) can be done with ACAPI_IFC_APIGuidToIFCGuid.
◆ ACAPI_Element_GetIFCProperties()
 GSErrCode __ACENV_CALL ACAPI_Element_GetIFCProperties  |  ( |  const API_Guid &  |  guid_Element,
|  bool  |  storedOnly,
|  GS::Array< API_IFCProperty > *  |  properties
)
Get IFC properties of an element.
Parameters
guid_Element | [in] GUID of the element
storedOnly | [in] Get only the core data without the derived content, must be false is most cases
properties | [out] IFC properties of the element
Returns
NoError - The function has completed with success.
APIERR_BADPARS - Invalid value passed in the guid_Element parameter or properties is nullptr.
APIERR_MODULNOTINSTALLED - IFC add-on is not present.
Remarks
This function returns the IFC properties of an element.
◆ ACAPI_Element_GetIFCPropertyValuePrimitiveType()
 GSErrCode __ACENV_CALL ACAPI_Element_GetIFCPropertyValuePrimitiveType  |  ( |  const GS::UniString &  |  valueType,
|  API_IFCPropertyValuePrimitiveType *  |  primitiveType
)
Get the primitive type of an IFC type.
Parameters
valueType | [in] IFC type of the property value
primitiveType | [out] Primitive type of the IFC type, see API_IFCPropertyAnyValue for values.
Returns
NoError - The function has completed with success.
APIERR_BADPARS - Invalid value passed in the valueType parameter or primitiveType is nullptr.
APIERR_MODULNOTINSTALLED - IFC add-on is not present.
◆ ACAPI_Element_GetIFCType()
 GSErrCode __ACENV_CALL ACAPI_Element_GetIFCType  |  ( |  const API_Guid &  |  elementID,
|  GS::UniString *  |  ifcType,
|  GS::UniString *  |  typeObjectIFCType
)
Get IFC type and IfcTypeObject IFC type of an element.
Parameters
elementID | [in] GUID of the element
ifcType | [out] IFC type of the element
typeObjectIFCType | [out] IFC type of the IfcTypeObject of the element
Returns
NoError - The function has completed with success.
APIERR_BADID - Invalid value passed in the elementID parameter.
APIERR_MODULNOTINSTALLED - IFC add-on is not present.
◆ ACAPI_Element_RemoveIFCClassificationReference()
 GSErrCode __ACENV_CALL ACAPI_Element_RemoveIFCClassificationReference  |  ( |  const API_Guid &  |  guid_Element,
|  const API_IFCClassificationReference &  |  classificationReference
)
Remove IFC classificationreference of an element.
Parameters
guid_Element | [in] GUID of the element
classificationReference | [in] IFC classificationreference to remove.
Returns
NoError - The function has completed with success.
APIERR_BADPARS - Invalid value passed in the guid_Element parameter or classificationReference is not correct.
APIERR_MODULNOTINSTALLED - IFC add-on is not present.
Remarks
If a classificationreference with the given referencename exists for the element, this function will remove it. For a successful removal, the classificationReference.referenceName must be set correctly explained in the API_IFCClassificationReference structure. The model may contain GDL objects with APPLICATION_QUERYs which display IFC data. It is the developer's responsability to refresh the views after modifying IFC data through API functions. See: ACAPI_Automation - ACAPI_View_Rebuild function.
◆ ACAPI_Element_RemoveIFCProperty()
 GSErrCode __ACENV_CALL ACAPI_Element_RemoveIFCProperty  |  ( |  const API_Guid &  |  guid_Element,
|  const API_IFCProperty &  |  property
)
Remove IFC property of an element.
Parameters
guid_Element | [in] GUID of the element
property | [in] IFC property to remove.
Returns
NoError - The function has completed with success.
APIERR_BADPARS - Invalid value passed in the guid_Element parameter or property is not correct.
APIERR_MODULNOTINSTALLED - IFC add-on is not present.
Remarks
If a property with the given property name and propertyset name exists for the element, this function will remove it. If a property is not editable on the user interface, cannot be removed. For a successful removal, the property.head must be set correctly explained in the API_IFCPropertyHead structure. The model may contain GDL objects with APPLICATION_QUERYs which display IFC data. It is the developer's responsability to refresh the views after modifying IFC data through API functions. See: ACAPI_Automation - ACAPI_View_Rebuild function.
◆ ACAPI_Element_SetIFCAttribute()
 GSErrCode __ACENV_CALL ACAPI_Element_SetIFCAttribute  |  ( |  const API_Guid &  |  guid_Element,
|  const API_IFCAttribute &  |  attribute
)
Set IFC attribute of an element.
Parameters
guid_Element | [in] GUID of the element
attribute | [in] IFC attribute to modify.
Returns
NoError - The function has completed with success.
APIERR_BADPARS - Invalid value passed in the guid_Element parameter or attribute is not correct.
APIERR_MODULNOTINSTALLED - IFC add-on is not present.
Remarks
This function sets the IFC attribute of an element. If an attribute with the given name and type exists for the element, this command will change it. If an attribute is not editable on the user interface, must not be changed. For a successful change, the attribute must be set correctly explained in the API_IFCAttribute structure. The model may contain GDL objects with APPLICATION_QUERYs which display IFC data. It is the developer's responsability to refresh the views after modifying IFC data through API functions. See: ACAPI_Automation - ACAPI_View_Rebuild function.
◆ ACAPI_Element_SetIFCClassificationReference()
 GSErrCode __ACENV_CALL ACAPI_Element_SetIFCClassificationReference  |  ( |  const API_Guid &  |  guid_Element,
|  const API_IFCClassificationReference &  |  classificationReference
)
Set IFC classificationreference of an element.
Parameters
guid_Element | [in] GUID of the element
classificationReference | [in] IFC classificationreference to add or modify.
Returns
NoError - The function has completed with success.
APIERR_BADPARS - Invalid value passed in the guid_Element parameter or classificationReference is not correct.
APIERR_MODULNOTINSTALLED - IFC add-on is not present.
Remarks
This function sets the IFC classificationreference of an element. If a classificationreference with the given referencename already exists for the element, this command will change it. For a successful setting, the classificationreference must be set correctly explained in the API_IFCClassificationReference structure. The model may contain GDL objects with APPLICATION_QUERYs which display IFC data. It is the developer's responsability to refresh the views after modifying IFC data through API functions. See: ACAPI_Automation - ACAPI_View_Rebuild function.
◆ ACAPI_Element_SetIFCProperty()
 GSErrCode __ACENV_CALL ACAPI_Element_SetIFCProperty  |  ( |  const API_Guid &  |  guid_Element,
|  const API_IFCProperty &  |  property
)
Set IFC property of an element.
Parameters
guid_Element | [in] GUID of the element
property | [in] IFC property to add or modify.
Returns
NoError - The function has completed with success.
APIERR_BADPARS - Invalid value passed in the guid_Element parameter or property is not correct.
APIERR_MODULNOTINSTALLED - IFC add-on is not present.
Remarks
This function sets the IFC property of an element. If a property with the given property name and propertyset name already exists for the element, this command will change it. If a property is not editable on the user interface, must not be changed. For a successful setting, the property must be set correctly explained in the API_IFCProperty structure. The model may contain GDL objects with APPLICATION_QUERYs which display IFC data. It is the developer's responsability to refresh the views after modifying IFC data through API functions. See: ACAPI_Automation - ACAPI_View_Rebuild function.
◆ ACAPI_IFC_APIGuidToIFCGuid()
 GSErrCode __ACENV_CALL ACAPI_IFC_APIGuidToIFCGuid  |  ( |  const API_Guid &  |  apiGuid,
|  GS::UniString &  |  ifcGuid
)
It converts an API_Guid to an IfcGloballyUniqueId string.
Since
Archicad 26
Parameters
apiGuid | [in] API_Guid need to be converted.
ifcGuid | [out] The resulting IfcGloballyUniqueId string.
Returns
NoError - The function has completed with success.
APIERR_BADPARS - If any error occured during the conversion.
Remarks
It converts an API_Guid to IfcGloballyUniqueId string. For example "C2E63FBC-194A-4895-A7A8-62C9B0D5CC7B" is converted to "32vZ_y6Kf8bQUeOicmrSnx".
◆ ACAPI_IFC_ComplementIFCDifferenceAndMergeIFCRelationshipData()
 GSErrCode __ACENV_CALL ACAPI_IFC_ComplementIFCDifferenceAndMergeIFCRelationshipData  |  ( |  const API_IFCRelationshipData &  |  olderIfcRelationshipData,
|  const API_IFCRelationshipData &  |  newerIfcRelationshipData,
|  API_IFCDifference &  |  ifcDifference,
|  API_IFCRelationshipData &  |  mergedIfcRelationshipData
)
Augments the ifcDifference with previously deleted items and merges olderIfcRelationshipData with newerIfcRelationshipData.
Since
Archicad 26
Parameters
olderIfcRelationshipData | [in] An olderly modified API_IFCRelationshipData.
newerIfcRelationshipData | [in] A newerly modified API_IFCRelationshipData.
ifcDifference | [in/out] The difference between the above two API_IFCRelationshipData.
mergedIfcRelationshipData | [out] The merged result of the above two API_IFCRelationshipData.
Returns
NoError - The function has completed with success.
APIERR_BADPARS - If any error occured executing the function.
Remarks
Merges olderIfcRelationshipData with newerIfcRelationshipData and complete ifcDifference with the deleted elements.
◆ ACAPI_IFC_GetIFCDifference()
 GSErrCode __ACENV_CALL ACAPI_IFC_GetIFCDifference  |  ( |  const API_IFCDifferenceGeneratorState &  |  previousIFCDifferenceGeneratorState,
|  const API_IFCDifferenceGeneratorState &  |  currentIFCDifferenceGeneratorState,
|  API_IFCDifference &  |  ifcDifference
)
Generates an IFC Difference based on the input parameters.
Since
Archicad 26
Parameters
previousIFCDifferenceGeneratorState | [in] Previous IFCDifference Generator state.
currentIFCDifferenceGeneratorState | [in] Current IFCDifference Generator state.
ifcDifference | [out] The resulting IFC Difference.
Returns
NoError - The function has completed with success.
APIERR_BADPARS - If any error occured during the conversion.
Remarks
It generates an IFC Difference based on the input parameters.
◆ ACAPI_IFC_GetIFCDifferenceState()
 GSErrCode __ACENV_CALL ACAPI_IFC_GetIFCDifferenceState  |  ( |  const API_Guid &  |  viewGuid,
|  const API_IFCTranslatorIdentifier &  |  ifcTranslatorIdentifier,
|  API_IFCDifferenceGeneratorState &  |  ifcDifferenceState
)
Generates an IFC Difference based on the input parameters.
Since
Archicad 26
Parameters
viewGuid | [in] Is a unique identifier of the View, which will be used for state generation.
ifcTranslatorIdentifier | [in] IFC Export Translator identifier.
ifcDifferenceState | [out] The resulting IFC Difference State.
Returns
NoError - The function has completed with success.
APIERR_BADPARS - Invalid view Guid or IFC Translator.
Remarks
It generates an IFC Difference State.
◆ ACAPI_IFC_GetIFCExportTranslatorsList()
 GSErrCode __ACENV_CALL ACAPI_IFC_GetIFCExportTranslatorsList  |  ( |  GS::Array< API_IFCTranslatorIdentifier > &  |  ifcExportTranslators | )
Returns the valid IFC Export Translators.
Since
Archicad 26
Parameters
ifcExportTranslators | [out] The resulting IFC Export Translators.
Returns
NoError - The function has completed with success.
APIERR_BADPARS - If any error occured during the conversion.
Remarks
Returns the valid IFC Export Translators. The first item of the ifcExportTranslators is the preview translator.
◆ ACAPI_IFC_GetIFCRelationshipData()
 GSErrCode __ACENV_CALL ACAPI_IFC_GetIFCRelationshipData  |  ( |  const API_IFCTranslatorIdentifier &  |  ifcTranslatorIdentifier,
|  API_IFCRelationshipData &  |  ifcRelationshipData
)
It generates an IFC Relationship Data based on the input IFC Translator parameter.
Since
Archicad 26
Parameters
ifcTranslatorIdentifier | [in] Neccessery parameter for generate IFC Relationship Data.
ifcRelationshipData | [out] The resulting IFC Relationship Data.
Returns
NoError - The function has completed with success.
APIERR_BADPARS - If any error occured during the Relationship Data generation.
Remarks
It generates an IFC Relationship Data based on the input parameters.
◆ ACAPI_IFC_IFCGuidToAPIGuid()
 GSErrCode __ACENV_CALL ACAPI_IFC_IFCGuidToAPIGuid  |  ( |  const GS::UniString &  |  ifcGuid,
|  API_Guid &  |  apiGuid
)
It converts an API_Guid to an IfcGloballyUniqueId string.
Since
Archicad 26
Parameters
ifcGuid | [in] IfcGloballyUniqueId string need to be converted.
apiGuid | [out] The resulting API_Guid.
Returns
NoError - The function has completed with success.
APIERR_BADPARS - If any error occured during the conversion.
Remarks
It converts an IfcGloballyUniqueId string to API_Guid. For example "32vZ_y6Kf8bQUeOicmrSnx" is converted to "C2E63FBC-194A-4895-A7A8-62C9B0D5CC7B".
◆ ACAPI_IFC_InvokeIFCDifferenceExportSettingsDlg()
 GSErrCode __ACENV_CALL ACAPI_IFC_InvokeIFCDifferenceExportSettingsDlg  |  ( |  API_Guid &  |  viewGuid,
|  API_IFCTranslatorIdentifier &  |  ifcTranslatorIdentifier
)
It opens a dialog where a View and an IFC Export Translator can be selected.
Since
Archicad 26
Parameters
viewGuid | [in/out] A view Guid. Returns the selected view guid.
ifcTranslatorIdentifier | [in/out] An IFC Export Translator. Returns the selected IFC Export Translator identifier.
Returns
NoError - The function has completed with success.
Cancel - The user cancelled the export settings dialog.
Remarks
A dialog where the user can select a View and an IFC Export Translator.